tap "homebrew/bundle"
tap "homebrew/services"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Write, edit, and chat about your code with AI
brew "cursor"
# Diff that understands syntax
brew "difftastic"
# Modern, maintained replacement for ls
brew "eza"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Blazing 💥 fast terminal-ui for git written in rust 🦀
brew "gitui"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Uninstall unwanted apps
cask "appcleaner"
# Free and open-source web browser
cask "chromium"
# Web browser
cask "google-chrome"
# Switch and track your input sources with ease
cask "input-source-pro"
# Menu bar calendar
cask "itsycal"
# Open-source keystroke visualiser
cask "keycastr"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Control your tools with a few keystrokes
cask "raycast"
# The minimal, blazing-fast, and infinitely customizable prompt for any shell
cask "starship"
# The Mac terminal for the 21st century
cask "warp"

mas "Bob", id: 1630034110
mas "Hidden Bar", id: 1452453066
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572