tap "homebrew/autoupdate", trusted: true
tap "resend/cli"

# Simple, modern, secure file encryption
brew "age"
# Official Amazon AWS command-line interface
brew "awscli"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Diff that understands syntax
brew "difftastic"
# Environment variables meet macOS Keychain and gnome-keyring
brew "envchain"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GitLab command-line tool
brew "glab"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# CLI for the Resend email API
brew "resend/cli/resend", trusted: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Snowflake Developer CLI for SQL and data warehouse operations
brew "snowflake-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Inconsolata LGC Nerd Font
cask "font-inconsolata-lgc-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Tool for multi-language users
cask "input-source-pro"
# Menu bar calendar
cask "itsycal"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Replacement for Docker Desktop
cask "orbstack"
# IDE for professional Python development
cask "pycharm"
# Control your tools with a few keystrokes
cask "raycast"
# Open-source code editor
cask "visual-studio-code"
mas "Bob", id: 1630034110
mas "Hidden Bar", id: 1452453066
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "WeChat", id: 836500024
mas "Xnip", id: 1221250572
