altimateai.vscode-altimate-mcp-server
biomejs.biome
bradlc.vscode-tailwindcss
csstools.postcss
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
innoverio.vscode-dbt-power-user
mhutchie.git-graph
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.vscode-typescript-next
naumovs.color-highlight
oderwat.indent-rainbow
pkief.material-icon-theme
rust-lang.rust-analyzer
samuelcolvin.jinjahtml
sleistner.vscode-fileutils
spywhere.guides
streetsidesoftware.code-spell-checker
unifiedjs.vscode-mdx
vscodevim.vim
zhuangtongfa.material-theme
ziglang.vscode-zig
